k6 Template/data/payload_ct.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ent="http://www.macys.com/enterprise_services"
    xmlns:v14="http://v14.services.datacollect.macys.com/">
    <soapenv:Header>
        <ent:requestor_info>
            <version>14.00.00</version>
            <client_id>D2C</client_id>
            <subclient_id>FIL</subclient_id>
        </ent:requestor_info>
    </soapenv:Header>
    <soapenv:Body>
        <v14:collectTotals>
            <!--Optional:-->
            <v14:CTRequest version="14">
                <ClientInfo>
                    <ProcessingApp>POS</ProcessingApp>
                    <AddedByApp>MCOM</AddedByApp>
                    <ClientVersion>3</ClientVersion>
                    <ReqKey>
                        <TimeStamp>2019-09-18T11:59:38.084-04:00</TimeStamp>
                        <ID>{{randomValue1}}</ID>
                        <SeqNum>1</SeqNum>
                    </ReqKey>
                </ClientInfo>
                <SttInfo>
                    <Div>MCY</Div>
                    <Date>2023-03-19</Date>
                    <Store>622</Store>
                    <Reg>{{randomValue2}}</Reg>
                    <Trans>{{randomValue2}}</Trans>
                </SttInfo>
                <TransIDInfo>
                    <TransCode>PRESALE_MEMO_EXCH</TransCode>
                    <VoidFlag>1</VoidFlag>
                    <SuspendFlag>1</SuspendFlag>
                    <RetrieveInfo>
                        <OrigReg>123</OrigReg>
                        <OrigTransTime>129</OrigTransTime>
                        <SuspendBarcode>123456789123456789FGTHG</SuspendBarcode>
                    </RetrieveInfo>
                    <TrainingFlag>0</TrainingFlag>
                    <OfflineFlag>0</OfflineFlag>
                    <StartTime>1970-01-01T10:51:00-05:00</StartTime>
                    <EndTime>1970-01-01T10:51:00-05:00</EndTime>
                    <ReceiptBarcodeId>32</ReceiptBarcodeId>
                    <CombinedSalescheckInfo>
                        <Status>SINGLE_TRANS</Status>
                    </CombinedSalescheckInfo>
                    <SendTrans>N</SendTrans>
                </TransIDInfo>
                <!--Optional:-->
                <AssociateInfo>
                    <Commission>1000081</Commission>
                    <Ringing>123456</Ringing>
                    <RingingRePrompt>0</RingingRePrompt>
                    <MgrOverride>123456</MgrOverride>
                    <Validation>1</Validation>
                    <Concierge>123456</Concierge>
                    <MBAAssocInfo>
                        <MBAAssociateNbr>71103000</MBAAssociateNbr>
                        <MBAType>INDIVIDUAL</MBAType>
                    </MBAAssocInfo>
                </AssociateInfo>
                <!--Optional:-->
                <StartingTrans>123</StartingTrans>
                <!--Optional:-->
                <EndingTrans>3435</EndingTrans>
                <!--Optional:-->
                <TotalTransCount>12324234</TotalTransCount>
                <!--Optional:-->
                <FinancialGrandTotals>
                    <!--Optional:-->
                    <GrossSales>124234</GrossSales>
                    <!--Optional:-->
                    <RdsBigTicket>
                        <!--Optional:-->
                        <Sales>123234</Sales>
                        <!--Optional:-->
                        <Returns>12323434</Returns>
                        <!--Optional:-->
                        <CreditCards>123575</CreditCards>
                    </RdsBigTicket>
                    <!--Optional:-->
                    <PaymentOnAccount>12345</PaymentOnAccount>
                </FinancialGrandTotals>
                <!--Optional:-->
                <FinancialTenderTotals>
                    <!--Optional:-->
                    <RedeemedTenders>
                        <!--Optional:-->
                        <PropCards>
                            <!--Optional:-->
                            <Macys>12345</Macys>
                            <!--Optional:-->
                            <MacysCobrandAmex>12344</MacysCobrandAmex>
                            <!--Optional:-->
                            <Bloomingdales>12324</Bloomingdales>
                            <!--Optional:-->
                            <BloomingdalesCobrandAmex>123521</BloomingdalesCobrandAmex>
                        </PropCards>
                        <!--Optional:-->
                        <BankCards>
                            <!--Optional:-->
                            <MasterCard>356</MasterCard>
                            <!--Optional:-->
                            <Visa>34654</Visa>
                            <!--Optional:-->
                            <AmericanExpress>657545</AmericanExpress>
                            <!--Optional:-->
                            <Discover>223534</Discover>
                        </BankCards>
                        <!--Optional:-->
                        <GiftCards>12</GiftCards>
                        <!--Optional:-->
                        <DebitCards>
                            <!--Optional:-->
                            <Mastercard>23554</Mastercard>
                            <!--Optional:-->
                            <Visa>232324</Visa>
                            <!--Optional:-->
                            <AmericanExpress>34523</AmericanExpress>
                            <!--Optional:-->
                            <Discover>32443623</Discover>
                            <!--Optional:-->
                            <Other>34554</Other>
                        </DebitCards>
                        <!--Optional:-->
                        <Paypal>1233412</Paypal>
                        <!--Optional:-->
                        <Cash>12323454</Cash>
                        <!--Optional:-->
                        <Checks>
                            <!--Optional:-->
                            <EFT>12</EFT>
                            <!--Optional:-->
                            <Paper>324543</Paper>
                            <!--Optional:-->
                            <Travelers>33245</Travelers>
                        </Checks>
                        <!--Optional:-->
                        <EECs>4354</EECs>
                        <!--Optional:-->
                        <MOCs>6544</MOCs>
                    </RedeemedTenders>
                    <IssuedCredit>
                        <BankCards>
                            <!--Optional:-->
                            <MasterCard>356</MasterCard>
                            <!--Optional:-->
                            <Visa>34654</Visa>
                            <!--Optional:-->
                            <AmericanExpress>657545</AmericanExpress>
                            <!--Optional:-->
                            <Discover>223534</Discover>
                        </BankCards>
                        <Cash>12323454</Cash>
                        <DebitCards>
                            <!--Optional:-->
                            <Mastercard>23554</Mastercard>
                            <!--Optional:-->
                            <Visa>232324</Visa>
                            <!--Optional:-->
                            <AmericanExpress>34523</AmericanExpress>
                            <!--Optional:-->
                            <Discover>32443623</Discover>
                            <!--Optional:-->
                            <Other>34554</Other>
                        </DebitCards>
                        <GiftCards>12</GiftCards>
                        <MOCs>6544</MOCs>
                        <PayPal>1233412</PayPal>
                        <PropCards>
                            <!--Optional:-->
                            <Macys>12345</Macys>
                            <!--Optional:-->
                            <MacysCobrandAmex>12344</MacysCobrandAmex>
                            <!--Optional:-->
                            <Bloomingdales>12324</Bloomingdales>
                            <!--Optional:-->
                            <BloomingdalesCobrandAmex>123521</BloomingdalesCobrandAmex>
                        </PropCards>
                    </IssuedCredit>
                    <IssuedChange>
                        <MOCs>6544</MOCs>
                    </IssuedChange>
                    <!--Optional:-->
                    <CashFunctions>
                        <!--Optional:-->
                        <Disbursements>234</Disbursements>
                        <!--Optional:-->
                        <Deposits>43523</Deposits>
                        <!--Optional:-->
                        <Pickups>1234</Pickups>
                        <!--Optional:-->
                        <AddToBankDeposits>12334</AddToBankDeposits>
                        <!--Optional:-->
                        <ChangeWithdrawWithoutDeposit>124543</ChangeWithdrawWithoutDeposit>
                        <!--Optional:-->
                        <NewAccountPayout>23454</NewAccountPayout>
                        <!--Optional:-->
                        <OpeningCash>2345432</OpeningCash>
                    </CashFunctions>
                    <!--Optional:-->
                    <CheckFunctions>
                        <!--Optional:-->
                        <Deposits>234</Deposits>
                        <!--Optional:-->
                        <Pickups>123532</Pickups>
                    </CheckFunctions>
                    <!--Optional:-->
                    <ChangeDrawerFunctions>
                        <!--Optional:-->
                        <Deposits>12434</Deposits>
                        <!--Optional:-->
                        <Pickups>123323</Pickups>
                        <!--Optional:-->
                        <Fulfillments>244334</Fulfillments>
                    </ChangeDrawerFunctions>
                </FinancialTenderTotals>
                <!--Optional:-->
                <MemoGrandTotals>
                    <!--Optional:-->
                    <PlaceOrder>234123</PlaceOrder>
                    <!--Optional:-->
                    <RdsBigTicket>
                        <!--Optional:-->
                        <Sales>4523</Sales>
                        <!--Optional:-->
                        <Returns>25234</Returns>
                        <!--Optional:-->
                        <CreditCards>235234</CreditCards>
                    </RdsBigTicket>
                    <!--Optional:-->
                    <Presale>2343324</Presale>
                    <!--Optional:-->
                    <SOCR>45234</SOCR>
                    <!--Optional:-->
                    <SpecialOrder>23453</SpecialOrder>
                </MemoGrandTotals>
                <!--Optional:-->
                <AssociateTotalsList>
                    <!--1
                    or more repetitions:-->
                    <AssociateTotals>
                        <!--Optional:-->
                        <AssociateNbr>3253</AssociateNbr>
                        <!--Optional:-->
                        <NetSales>23434</NetSales>
                        <!--Optional:-->
                        <ItemCount>3245</ItemCount>
                        <!--Optional:-->
                        <TransCount>2135</TransCount>
                    </AssociateTotals>
                </AssociateTotalsList>
            </v14:CTRequest>
        </v14:collectTotals>
    </soapenv:Body>
</soapenv:Envelope>